In [44]:
import pandas as pd
import numpy as np

In [45]:
df = pd.read_csv("../../Datasets/Banknifty/banknifty_data.csv")

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5569 entries, 0 to 5568
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  5569 non-null   int64
 1   time        5569 non-null   object
 2   open        5569 non-null   float64
 3   high        5569 non-null   float64
 4   low         5569 non-null   float64
 5   close       5569 non-null   float64
 6   weekday     5569 non-null   int64
 7   range_HL    5569 non-null   float64
 8   range_OC    5569 non-null   float64
 9   type        5569 non-null   object
dtypes: float64(6), int64(2), object(2)
memory usage: 435.2+ KB

In [47]:
df["type"].unique()

array(['Tie', 'bear', 'bull'], dtype=object)

In [48]:
df[df["type"] == "Tie"]

,Unnamed: 0,time,open,high,low,close,weekday,range_HL,range_OC,type
0,0,2000-01-03 09:15:00+05:30,1054.8101,1054.8101,1054.8101,1054.8101,0,0.0,0.0,Tie
1,1,2000-01-04 09:15:00+05:30,1092.0800,1092.0800,1092.0800,1092.0800,1,0.0,0.0,Tie
2,2,2000-01-05 09:15:00+05:30,1055.9900,1055.9900,1055.9900,1055.9900,2,0.0,0.0,Tie
3,3,2000-01-06 09:15:00+05:30,1086.6700,1086.6700,1086.6700,1086.6700,3,0.0,0.0,Tie
4,4,2000-01-07 09:15:00+05:30,1126.9900,1126.9900,1126.9900,1126.9900,4,0.0,0.0,Tie
...,...,...,...,...,...,...,...,...,...,...
1731,1731,2006-12-06 09:15:00+05:30,6213.8501,6213.8501,6213.8501,6213.8501,2,0.0,0.0,Tie
1732,1732,2006-12-07 09:15:00+05:30,6259.5000,6259.5000,6259.5000,6259.5000,3,0.0,0.0,Tie
1809,1809,2007-04-03 09:15:00+05:30,4995.1499,4995.1499,4995.1499,4995.1499,1,0.0,0.0,Tie
2085,2085,2008-05-12 09:15:00+05:30,7330.5498,7330.5498,7330.5498,7330.5498,0,0.0,0.0,Tie
2319,2319,2009-04-30 09:15:00+05:30,5130.9502,5130.9502,5130.9502,5130.9502,3,0.0,0.0,Tie

In [49]:
df.drop(df[df["type"] == "Tie"].index)

,Unnamed: 0,time,open,high,low,close,weekday,range_HL,range_OC,type
1361,1361,2005-06-09 09:15:00+05:30,3659.8000,3664.4500,3609.7500,3636.5000,3,54.7000,23.3000,bear
1362,1362,2005-06-10 09:15:00+05:30,3640.0500,3665.8000,3585.8000,3593.5500,4,80.0000,46.5000,bear
1363,1363,2005-06-13 09:15:00+05:30,3593.8999,3648.3999,3556.7000,3642.8999,0,91.6999,49.0000,bull
1364,1364,2005-06-14 09:15:00+05:30,3649.0500,3696.3501,3637.7000,3689.8000,1,58.6501,40.7500,bull
1365,1365,2005-06-15 09:15:00+05:30,3700.8000,3703.7500,3662.8501,3683.8501,2,40.8999,16.9499,bear
...,...,...,...,...,...,...,...,...,...,...
5564,5564,2022-06-13 09:15:00+05:30,33728.6480,33774.0510,33210.3520,33405.8520,0,563.6990,322.7960,bear
5565,5565,2022-06-14 09:15:00+05:30,33180.6020,33618.1480,33123.8980,33311.3520,1,494.2500,130.7500,bull
5566,5566,2022-06-15 09:15:00+05:30,33317.8010,33554.5510,33249.5510,33339.0000,2,305.0000,21.1990,bull
5567,5567,2022-06-16 09:15:00+05:30,33648.8010,33756.5000,32537.9490,32617.1000,3,1218.5510,1031.7010,bear
5568,5568,2022-06-17 09:15:00+05:30,32393.4490,32889.8010,32290.5510,32743.0510,4,599.2500,349.6020,bull

In [50]:
len(df)

5569

In [51]:
dic = {}
for i in df["type"].unique():
    dic[i] = df[df["type"] == i]["type"].count()
print(dic)

{'Tie': 1367, 'bear': 2179, 'bull': 2023}

In [52]:
df.tail(10)

,Unnamed: 0,time,open,high,low,close,weekday,range_HL,range_OC,type
5559,5559,2022-06-06 09:15:00+05:30,35159.148,35424.500,35072.301,35310.199,0,352.199,151.051,bull
5560,5560,2022-06-07 09:15:00+05:30,35080.801,35154.301,34834.398,34996.000,1,319.903,84.801,bear
5561,5561,2022-06-08 09:15:00+05:30,35165.648,35449.898,34831.750,34946.148,2,618.148,219.500,bear
5562,5562,2022-06-09 09:15:00+05:30,34802.250,35149.102,34659.102,35085.449,3,490.000,283.199,bull
5563,5563,2022-06-10 09:15:00+05:30,34686.949,34752.449,34346.648,34483.801,4,405.801,203.148,bear
5564,5564,2022-06-13 09:15:00+05:30,33728.648,33774.051,33210.352,33405.852,0,563.699,322.796,bear
5565,5565,2022-06-14 09:15:00+05:30,33180.602,33618.148,33123.898,33311.352,1,494.250,130.750,bull
5566,5566,2022-06-15 09:15:00+05:30,33317.801,33554.551,33249.551,33339.000,2,305.000,21.199,bull
5567,5567,2022-06-16 09:15:00+05:30,33648.801,33756.500,32537.949,32617.100,3,1218.551,1031.701,bear
5568,5568,2022-06-17 09:15:00+05:30,32393.449,32889.801,32290.551,32743.051,4,599.250,349.602,bull

In [53]:

for i in df["type"].unique():
    print(i)
    dic = {}
    for j in range(5):
        dic[j] = ((df.loc[(df["type"] == i)&(df["weekday"] == j)]["weekday"].count()) / df.loc[(df["weekday"] == j)]["weekday"].count()).round(2)
    print(dic)

Tie
{0: 0.25, 1: 0.25, 2: 0.24, 3: 0.25, 4: 0.24}
bear
{0: 0.38, 1: 0.4, 2: 0.4, 3: 0.39, 4: 0.38}
bull
{0: 0.37, 1: 0.35, 2: 0.35, 3: 0.36, 4: 0.38}

In [54]:
df.columns

Index(['Unnamed: 0', 'time', 'open', 'high', 'low', 'close', 'weekday',
       'range_HL', 'range_OC', 'type'],
      dtype='object')

In [55]:
df.iloc[2000]

Unnamed: 0                         2000
time          2008-01-04 09:15:00+05:30
open                           10288.05
high                           10326.25
low                             10120.9
close                           10233.2
weekday                               4
range_HL                         205.35
range_OC                          54.85
type                               bear
Name: 2000, dtype: object

In [56]:
df.columns

Index(['Unnamed: 0', 'time', 'open', 'high', 'low', 'close', 'weekday',
       'range_HL', 'range_OC', 'type'],
      dtype='object')

In [58]:
len(df)

5569

In [59]:
df.head()

,Unnamed: 0,time,open,high,low,close,weekday,range_HL,range_OC,type
0,0,2000-01-03 09:15:00+05:30,1054.8101,1054.8101,1054.8101,1054.8101,0,0.0,0.0,Tie
1,1,2000-01-04 09:15:00+05:30,1092.0800,1092.0800,1092.0800,1092.0800,1,0.0,0.0,Tie
2,2,2000-01-05 09:15:00+05:30,1055.9900,1055.9900,1055.9900,1055.9900,2,0.0,0.0,Tie
3,3,2000-01-06 09:15:00+05:30,1086.6700,1086.6700,1086.6700,1086.6700,3,0.0,0.0,Tie
4,4,2000-01-07 09:15:00+05:30,1126.9900,1126.9900,1126.9900,1126.9900,4,0.0,0.0,Tie

In [60]:
df.set_index("time")

,Unnamed: 0,open,high,low,close,weekday,range_HL,range_OC,type
time,,,,,,,,,
2000-01-03 09:15:00+05:30,0,1054.8101,1054.8101,1054.8101,1054.8101,0,0.000,0.000,Tie
2000-01-04 09:15:00+05:30,1,1092.0800,1092.0800,1092.0800,1092.0800,1,0.000,0.000,Tie
2000-01-05 09:15:00+05:30,2,1055.9900,1055.9900,1055.9900,1055.9900,2,0.000,0.000,Tie
2000-01-06 09:15:00+05:30,3,1086.6700,1086.6700,1086.6700,1086.6700,3,0.000,0.000,Tie
2000-01-07 09:15:00+05:30,4,1126.9900,1126.9900,1126.9900,1126.9900,4,0.000,0.000,Tie
...,...,...,...,...,...,...,...,...,...
2022-06-13 09:15:00+05:30,5564,33728.6480,33774.0510,33210.3520,33405.8520,0,563.699,322.796,bear
2022-06-14 09:15:00+05:30,5565,33180.6020,33618.1480,33123.8980,33311.3520,1,494.250,130.750,bull
2022-06-15 09:15:00+05:30,5566,33317.8010,33554.5510,33249.5510,33339.0000,2,305.000,21.199,bull
2022-06-16 09:15:00+05:30,5567,33648.8010,33756.5000,32537.9490,32617.1000,3,1218.551,1031.701,bear
2022-06-17 09:15:00+05:30,5568,32393.4490,32889.8010,32290.5510,32743.0510,4,599.250,349.602,bull

In [61]:
type(df.index)

pandas.core.indexes.range.RangeIndex

In [63]:
pd.Timestamp("2000-01-03 09:15:00+05:30")

Timestamp('2000-01-03 09:15:00+0530', tz='pytz.FixedOffset(330)')

In [67]:
pd.Period("2000-01-03 09:15:00+05:30")

Period('2000-01-03 09:15:00', 'S')

In [71]:
df.reset_index

<bound method DataFrame.reset_index of       Unnamed: 0                       time        open        high  \
0              0  2000-01-03 09:15:00+05:30   1054.8101   1054.8101
1              1  2000-01-04 09:15:00+05:30   1092.0800   1092.0800
2              2  2000-01-05 09:15:00+05:30   1055.9900   1055.9900
3              3  2000-01-06 09:15:00+05:30   1086.6700   1086.6700
4              4  2000-01-07 09:15:00+05:30   1126.9900   1126.9900
...          ...                        ...         ...         ...
5564        5564  2022-06-13 09:15:00+05:30  33728.6480  33774.0510
5565        5565  2022-06-14 09:15:00+05:30  33180.6020  33618.1480
5566        5566  2022-06-15 09:15:00+05:30  33317.8010  33554.5510
5567        5567  2022-06-16 09:15:00+05:30  33648.8010  33756.5000
5568        5568  2022-06-17 09:15:00+05:30  32393.4490  32889.8010

             low       close  weekday  range_HL  range_OC  type
0      1054.8101   1054.8101        0     0.000     0.000   Tie
1      1092.0800   1092.0800        1     0.000     0.000   Tie
2      1055.9900   1055.9900        2     0.000     0.000   Tie
3      1086.6700   1086.6700        3     0.000     0.000   Tie
4      1126.9900   1126.9900        4     0.000     0.000   Tie
...          ...         ...      ...       ...       ...   ...
5564  33210.3520  33405.8520        0   563.699   322.796  bear
5565  33123.8980  33311.3520        1   494.250   130.750  bull
5566  33249.5510  33339.0000        2   305.000    21.199  bull
5567  32537.9490  32617.1000        3  1218.551  1031.701  bear
5568  32290.5510  32743.0510        4   599.250   349.602  bull

[5569 rows x 10 columns]>

In [72]:
df.head()

,Unnamed: 0,time,open,high,low,close,weekday,range_HL,range_OC,type
0,0,2000-01-03 09:15:00+05:30,1054.8101,1054.8101,1054.8101,1054.8101,0,0.0,0.0,Tie
1,1,2000-01-04 09:15:00+05:30,1092.0800,1092.0800,1092.0800,1092.0800,1,0.0,0.0,Tie
2,2,2000-01-05 09:15:00+05:30,1055.9900,1055.9900,1055.9900,1055.9900,2,0.0,0.0,Tie
3,3,2000-01-06 09:15:00+05:30,1086.6700,1086.6700,1086.6700,1086.6700,3,0.0,0.0,Tie
4,4,2000-01-07 09:15:00+05:30,1126.9900,1126.9900,1126.9900,1126.9900,4,0.0,0.0,Tie

In [75]:
df.drop("Unnamed: 0",axis=1,inplace=True)

In [76]:
df.head()

,time,open,high,low,close,weekday,range_HL,range_OC,type
0,2000-01-03 09:15:00+05:30,1054.8101,1054.8101,1054.8101,1054.8101,0,0.0,0.0,Tie
1,2000-01-04 09:15:00+05:30,1092.0800,1092.0800,1092.0800,1092.0800,1,0.0,0.0,Tie
2,2000-01-05 09:15:00+05:30,1055.9900,1055.9900,1055.9900,1055.9900,2,0.0,0.0,Tie
3,2000-01-06 09:15:00+05:30,1086.6700,1086.6700,1086.6700,1086.6700,3,0.0,0.0,Tie
4,2000-01-07 09:15:00+05:30,1126.9900,1126.9900,1126.9900,1126.9900,4,0.0,0.0,Tie

In [78]:
df.iloc[0]

time        2000-01-03 09:15:00+05:30
open                        1054.8101
high                        1054.8101
low                         1054.8101
close                       1054.8101
weekday                             0
range_HL                          0.0
range_OC                          0.0
type                              Tie
Name: 0, dtype: object

In [79]:
df["time"] = df["time"].apply(lambda x : pd.Period(x))

In [86]:
df.set_index("time",inplace=True)

In [85]:
df.head()

,time,open,high,low,close,weekday,range_HL,range_OC,type
0,2000-01-03 09:15:00,1054.8101,1054.8101,1054.8101,1054.8101,0,0.0,0.0,Tie
1,2000-01-04 09:15:00,1092.0800,1092.0800,1092.0800,1092.0800,1,0.0,0.0,Tie
2,2000-01-05 09:15:00,1055.9900,1055.9900,1055.9900,1055.9900,2,0.0,0.0,Tie
3,2000-01-06 09:15:00,1086.6700,1086.6700,1086.6700,1086.6700,3,0.0,0.0,Tie
4,2000-01-07 09:15:00,1126.9900,1126.9900,1126.9900,1126.9900,4,0.0,0.0,Tie

In [87]:
type(df.index)

pandas.core.indexes.period.PeriodIndex

# Convereting to Datetime

In [96]:
d1 = ['2 June 2013', 'Aug 29, 2014', '2015-06-26', '7/12/16']

# And just some random data
ts3 = pd.DataFrame(np.random.randint(10, 100, (4,2)), index=d1, 
                   columns=list('ab'))
ts3

               a   b
2 June 2013   39  90
Aug 29, 2014  23  96
2015-06-26    48  96
7/12/16       75  37

In [97]:
ts3.index

Index(['2 June 2013', 'Aug 29, 2014', '2015-06-26', '7/12/16'], dtype='object')

In [94]:
ts3.index = pd.to_datetime(ts3.index)

In [95]:
ts3.index

DatetimeIndex(['2013-06-02', '2014-08-29', '2015-06-26', '2016-07-12'], dtype='datetime64[ns]', freq=None)

In [101]:
pd.to_datetime("4.3.2023",dayfirst=True).day

4

# TimeDelta

In [102]:
# Timedeltas are differences in times. This is not the same as a a period, but conceptually similar. For
# instance, if we want to take the difference between September 3rd and  September 1st, we get a Timedelta of
# two days.
pd.Timestamp('9/3/2016')-pd.Timestamp('9/1/2016')

Timedelta('2 days 00:00:00')

In [105]:
pd.Timestamp('9/2/2016 8:10AM') + pd.Timedelta('3Y 1M 12D 3H')

C:\Users\SPURUSHO\AppData\Local\Temp\ipykernel_11912\2870131770.py:1: FutureWarning: Units 'M', 'Y' and 'y' do not represent unambiguous timedelta values and will be removed in a future version.
  pd.Timestamp('9/2/2016 8:10AM') + pd.Timedelta('3Y 1M 12D 3H')

Timestamp('2019-09-15 04:38:36')

In [107]:
from datetime import datetime
time_abhi = datetime.now()

In [114]:
time_abhi.today()

datetime.datetime(2023, 4, 27, 12, 24, 33, 262490)

In [116]:
datetime.now()

datetime.datetime(2023, 4, 27, 12, 24, 49, 10075)

In [117]:
time_abhi.weekday()

3

In [122]:
pd.Timestamp("27/4/2023").weekday()

C:\Users\SPURUSHO\AppData\Local\Temp\ipykernel_11912\3411606104.py:1: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  pd.Timestamp("27/4/2023").weekday()

3

In [130]:
pd.Timestamp('9/4/2016').weekday()

6

# OFFSETS

In [134]:
pd.Timestamp('9/4/2016') + pd.offsets.Week()

Timestamp('2016-09-11 00:00:00')

In [137]:
pd.Timestamp('27/05/2023') + pd.offsets.MonthEnd()

C:\Users\SPURUSHO\AppData\Local\Temp\ipykernel_11912\3843231738.py:1: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  pd.Timestamp('27/05/2023') + pd.offsets.MonthEnd()

Timestamp('2023-05-31 00:00:00')

In [139]:
pd.Timestamp('27/05/2023') + pd.offsets.MonthEnd()

C:\Users\SPURUSHO\AppData\Local\Temp\ipykernel_11912\3843231738.py:1: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  pd.Timestamp('27/05/2023') + pd.offsets.MonthEnd()

Timestamp('2023-05-31 00:00:00')

In [149]:
pd.Timestamp('28/04/2023') + pd.offsets.BDay()

C:\Users\SPURUSHO\AppData\Local\Temp\ipykernel_11912\3987870935.py:1: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  pd.Timestamp('28/04/2023') + pd.offsets.BDay()

Timestamp('2023-05-01 00:00:00')

In [145]:
pd.Timestamp('2023-0-29 00:00:00')

0

In [150]:
pd.Timestamp(datetime.now()) + pd.offsets.BDay()

Timestamp('2023-04-28 12:36:47.243284')

# Date_Range

In [151]:
dates = pd.date_range('10-01-2016', periods=9, freq='2W-SUN')
dates

DatetimeIndex(['2016-10-02', '2016-10-16', '2016-10-30', '2016-11-13',
               '2016-11-27', '2016-12-11', '2016-12-25', '2017-01-08',
               '2017-01-22'],
              dtype='datetime64[ns]', freq='2W-SUN')

In [152]:
dates = pd.date_range('27/04/2023', periods=9, freq='B')

C:\Users\SPURUSHO\AppData\Local\Temp\ipykernel_11912\510718256.py:1: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  dates = pd.date_range('27/04/2023', periods=9, freq='B')

In [153]:
dates

DatetimeIndex(['2023-04-27', '2023-04-28', '2023-05-01', '2023-05-02',
               '2023-05-03', '2023-05-04', '2023-05-05', '2023-05-08',
               '2023-05-09'],
              dtype='datetime64[ns]', freq='B')

In [154]:
pd.date_range('04-01-2016', periods=12, freq='QS-JUN')

DatetimeIndex(['2016-06-01', '2016-09-01', '2016-12-01', '2017-03-01',
               '2017-06-01', '2017-09-01', '2017-12-01', '2018-03-01',
               '2018-06-01', '2018-09-01', '2018-12-01', '2019-03-01'],
              dtype='datetime64[ns]', freq='QS-JUN')

In [155]:
dates = pd.date_range('10-01-2016', periods=9, freq='2W-SUN')
df = pd.DataFrame({'Count 1': 100 + np.random.randint(-5, 10, 9).cumsum(),
                  'Count 2': 120 + np.random.randint(-5, 10, 9)}, index=dates)
df

            Count 1  Count 2
2016-10-02      100      119
2016-10-16       98      119
2016-10-30       98      121
2016-11-13      107      121
2016-11-27      111      128
2016-12-11      112      122
2016-12-25      112      116
2017-01-08      119      118
2017-01-22      123      125

In [156]:
df.index.weekday

Int64Index([6, 6, 6, 6, 6, 6, 6, 6, 6], dtype='int64')

In [157]:
df.diff()

            Count 1  Count 2
2016-10-02      NaN      NaN
2016-10-16     -2.0      0.0
2016-10-30      0.0      2.0
2016-11-13      9.0      0.0
2016-11-27      4.0      7.0
2016-12-11      1.0     -6.0
2016-12-25      0.0     -6.0
2017-01-08      7.0      2.0
2017-01-22      4.0      7.0

In [158]:
df.resample('M').mean()

               Count 1     Count 2
2016-10-31   98.666667  119.666667
2016-11-30  109.000000  124.500000
2016-12-31  112.000000  119.000000
2017-01-31  121.000000  121.500000

In [159]:
df["2017"]

C:\Users\SPURUSHO\AppData\Local\Temp\ipykernel_11912\2104988236.py:1: FutureWarning: Indexing a DataFrame with a datetimelike index using a single string to slice the rows, like `frame[string]`, is deprecated and will be removed in a future version. Use `frame.loc[string]` instead.
  df["2017"]

            Count 1  Count 2
2017-01-08      119      118
2017-01-22      123      125

In [160]:
df.head()

            Count 1  Count 2
2016-10-02      100      119
2016-10-16       98      119
2016-10-30       98      121
2016-11-13      107      121
2016-11-27      111      128